<?php
   /* Filename       :  index.php
    * Description    :  index page of the site
    * Version        :  1.0
    * Last modified  :  2008/11/04 19:37:28
    */   

   $DOCUMENT_ROOT = $_SERVER['DOCUMENT_ROOT'];
   require ("$DOCUMENT_ROOT/../site/begin_user_session.php");
   require ("$DOCUMENT_ROOT/../site/pageclass.php");
   require ("$DOCUMENT_ROOT/../site/display_functions.php");
   
   $pagecontent = '
   <h2>Цел на проекта</h2>
   <p>Целта на този проект е да помога за развитието и популяризирането на 
    UNIX &copy; операционните системи в България. Тази подкрепа ще се изразява
    чрез превеждането на вече съществуваща документация и/или написването на
    нова такава, която да бъде от полза на българските потребители. 
    Главният акцент от операционните системи ще бъде върху операционните системи
    с отворен код - такива като системите от BSD семейството - FreeBSD, 
    OpenBSD, NetBSD, също така QNX, Linux и нейните дистрибуции и много други.</p>
    
    <p>Тук също ще можете да намерите материали по програмиране за различни
    програмни езици и среди. Ако имате въпроси не се колебайте, а ги задайте
    във Форумите.</p>
    
    <p>Една от главната цел и задача на този проект е той да бъде място,
    където българските потребители на тези ОС-и и програмисти да споделят опит
    и знания - бързо и лесно.</p>
    
    <p>С времето ще бъдат добавяни нови статии и ръководства. Ако Вие сте 
    написали статия, ръководство или програма и искате да я споделите с други
    потребители - пратете ни e-mail - Вашият принос е важен и ще бъде оценен!</p>
    
    <hr /><h2>Участници в Проекта</h2>
    <p>За да вземете участие в този проект не е необходимо да бъдете програмист
    или системен администратор. Хората, които умеят да превеждат са от също
    толкова голямо значение както всички останали.</p>
    
    <p>Ако мислите, че можете и искате да помогнете за развитието на този 
    проект - пишете ни във Форумите или използвайте формата за Контакти.
    Ще се радваме да се присъедините към нашето общество.</p>
    
    <hr /><h2>Развитие на Проекта</h2>
    <p>Проектът е в процес на непрекъснато развитие. С времето надяваме се
    ще продължим да се разрастваме и ще трупаме повече и повече материали,
    които да бъдат от полза на потребителите.</p>
    
    <p>Ако сте заинтересовани от идеята на този проект - пишете ни - 
    ще се радваме да чуем Вашите отзиви и мнения!</p>';
   
   $index = new PageClass ();
   $index->SetContent ($pagecontent);
   $index->Display ();
?>
